# Madison Qualley
## Week 13 11/22/2020
### Python - Pandas DataFrame Processing

In [1]:
import numpy as np

from pandas import Series,DataFrame
import pandas as pd

In [4]:
#Drop entries
df = DataFrame(np.arange(16).reshape ((4,4)),
                index = ['Ohio','Colorado','Utah','New York'],
                columns = ['one','two','three','four'])

df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [5]:
df.values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [6]:
df.drop(['Colorado'])

          one  two  three  four
Ohio        0    1      2     3
Utah        8    9     10    11
New York   12   13     14    15

In [7]:
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [10]:
df.drop('two', axis = 1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [11]:
df.drop('two', axis = 'columns')

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [13]:
df.drop('two', inplace = True, axis = 'columns')
df

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [14]:
#select entries
df = DataFrame(np.arange(16).reshape ((4,4)),
                index = ['Ohio','Colorado','Utah','New York'],
                columns = ['one','two','three','four'])

df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [15]:
df['one']

Ohio         0
Colorado     4
Utah         8
New York    12
Name: one, dtype: int32

In [16]:
df[['one','four']]

          one  four
Ohio        0     3
Colorado    4     7
Utah        8    11
New York   12    15

In [17]:
df[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [18]:
df[df['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [19]:
df > 5

            one    two  three   four
Ohio      False  False  False  False
Colorado  False  False   True   True
Utah       True   True   True   True
New York   True   True   True   True

In [20]:
df[ df < 5] = 0
df

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [21]:
#select entries with loc and iloc
df.loc['Colorado']

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [22]:
df.loc['Colorado', ['two','four']]

two     5
four    7
Name: Colorado, dtype: int32

In [23]:
df

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [24]:
df.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [29]:
df.iloc[2, [3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [40]:
df.iloc[[1,2], [3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [45]:
df1 = DataFrame(np.arange(9) .reshape((3,3)), columns=list('bcd'),
               index=['Ohio','Texas','Colorado'])

df2 = DataFrame(np.arange(12) .reshape((4,3)), columns=list('bde'),
               index = ['Utah', 'Ohio', 'Texas', 'Oregon'])

df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [46]:
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [47]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [48]:
df1.add(df2,fill_value = 0)

            b    c     d     e
Colorado  6.0  7.0   8.0   NaN
Ohio      3.0  1.0   6.0   5.0
Oregon    9.0  NaN  10.0  11.0
Texas     9.0  4.0  12.0   8.0
Utah      0.0  NaN   1.0   2.0

In [49]:
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [50]:
df1['e'] = df1['b'] +df1['d']

In [51]:
df1.add(df2,fill_value = 0)

            b    c     d     e
Colorado  6.0  7.0   8.0  14.0
Ohio      3.0  1.0   6.0   7.0
Oregon    9.0  NaN  10.0  11.0
Texas     9.0  4.0  12.0  16.0
Utah      0.0  NaN   1.0   2.0

In [52]:
#operation between dataframe and series
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [53]:
s = df.iloc[0]
s

one      0
two      0
three    0
four     0
Name: Ohio, dtype: int32

In [54]:
df2 - s

         b   d   e  four  one  three  two
Utah   NaN NaN NaN   NaN  NaN    NaN  NaN
Ohio   NaN NaN NaN   NaN  NaN    NaN  NaN
Texas  NaN NaN NaN   NaN  NaN    NaN  NaN
Oregon NaN NaN NaN   NaN  NaN    NaN  NaN

In [55]:
s = df2.iloc[0]
s

b    0
d    1
e    2
Name: Utah, dtype: int32

In [56]:
df2 - s

        b  d  e
Utah    0  0  0
Ohio    3  3  3
Texas   6  6  6
Oregon  9  9  9

In [57]:
#sort and rank
df3 = DataFrame(np.arange(8).reshape(2,4), columns=list('dabc'),
               index=['three','one'])

df3

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [58]:
df3.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [59]:
df3.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [60]:
df3.sort_index(axis=1,ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [63]:
df4 = DataFrame({'b':[4,7,-3,2],'a':[0,1,0,1]})
df4

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [66]:
df4.sort_values(by = 'b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [67]:
df4.sort_values(by =['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [68]:
df4

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [69]:
df5 = DataFrame({'b':[12,13,14,15],'a':[10,11,12,11]})
df5

    b   a
0  12  10
1  13  11
2  14  12
3  15  11

In [70]:
df4.rank()

     b    a
0  3.0  1.5
1  4.0  3.5
2  1.0  1.5
3  2.0  3.5

In [71]:
#summarizing data
df1 = DataFrame([[1.4,np.nan],[7.1,-4.5], [np.nan,np.nan], [0.75,-1.3]],
               index=['a','b','c','d'],
               columns = ['one','two'])

df

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [72]:
df.sum()

one      20
two      27
three    30
four     33
dtype: int64

In [73]:
df.sum(axis = 1)

Ohio         0
Colorado    18
Utah        38
New York    54
dtype: int64

In [74]:
df.sum(axis = 'columns')

Ohio         0
Colorado    18
Utah        38
New York    54
dtype: int64

In [75]:
df.mean()

one      5.00
two      6.75
three    7.50
four     8.25
dtype: float64

In [76]:
df.mean(axis = 1)

Ohio         0.0
Colorado     4.5
Utah         9.5
New York    13.5
dtype: float64

In [78]:
df.mean(axis = 1, skipna = False)

Ohio         0.0
Colorado     4.5
Utah         9.5
New York    13.5
dtype: float64

In [79]:
df.min()

one      0
two      0
three    0
four     0
dtype: int32

In [80]:
df.idxmax()

one      New York
two      New York
three    New York
four     New York
dtype: object

In [81]:
df

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [82]:
df.describe()

        one        two      three       four
count   4.0   4.000000   4.000000   4.000000
mean    5.0   6.750000   7.500000   8.250000
std     6.0   5.560276   5.972158   6.396614
min     0.0   0.000000   0.000000   0.000000
25%     0.0   3.750000   4.500000   5.250000
50%     4.0   7.000000   8.000000   9.000000
75%     9.0  10.000000  11.000000  12.000000
max    12.0  13.000000  14.000000  15.000000

In [ ]:
#missing data